20231229153554-5_methods.org
:PROPERTIES:
:ID:       bbdbfe01-7990-4a7b-9f68-151d9046609d
:END:
#+title: 5. Methods
#+filetags: :OCP:

* Chapter 5. Methods

** Exam Objectives

*** Utilizing Java Object­Oriented Approach

- Create ~classes~ and ~records~, and define and use ~instance~ and [[id:90b4776a-f230-4e13-b1a1-248b48026677][Static Variables]] and [[id:71f8ac46-9cca-4866-b701-8f5a7f9f7fc0][Static Methods]], ~constructors~, and ~instance~ and [[id:9b5e5215-73c3-412e-8a72-57dc575c1ee9][Static Initializers]].

- Implement ~overloading~, including [[id:9bb3ac0e-af2c-4243-9ae2-f2bfbee868c3][vararg]] ~methods~

** 1. [[id:4ee42137-51b3-40cf-91b0-209b5e8f8562][Designing Methods]]

** 2. [[id:c625f085-1416-483d-8344-47c2b4026643][Declaring Local and Instance Variables]]

** 3. [[id:68baee3c-a388-4f42-b24b-605e792c6c0a][Working with Varargs]]

** 4. [[id:67178034-6c34-44e5-ab5a-ea09f1aaa874][Applying Access Modifiers]]

** 5. [[id:abb7e1f4-8631-46e8-b272-9a86180ac34f][Accessing Static Data]]

** 6. [[id:5abc014e-1d13-4b57-80ca-ec233c6fff44][Passing Data among Methods]]

** 7. [[id:28b95eeb-be70-4b92-b599-aa95d6d9b5d7][Overloading Methods]]
