20231229153554-5_methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>5. Methods</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">5. Methods</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org671e200">1. Chapter 5. Methods</a>
<ul>
<li><a href="#org87674a0">1.1. Exam Objectives</a>
<ul>
<li><a href="#org9789448">1.1.1. Utilizing Java Object­Oriented Approach</a></li>
</ul>
</li>
<li><a href="#org6db0f1a">1.2. 1. Designing Methods</a></li>
<li><a href="#org3fb69e5">1.3. 2. Declaring Local and Instance Variables</a></li>
<li><a href="#orgae19b7c">1.4. 3. Working with Varargs</a></li>
<li><a href="#org96c39bf">1.5. 4. Applying Access Modifiers</a></li>
<li><a href="#org90f5b92">1.6. 5. Accessing Static Data</a></li>
<li><a href="#orga085a77">1.7. 6. Passing Data among Methods</a></li>
<li><a href="#org5420a11">1.8. 7. Overloading Methods</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org671e200" class="outline-2">
<h2 id="org671e200"><span class="section-number-2">1.</span> Chapter 5. Methods</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org87674a0" class="outline-3">
<h3 id="org87674a0"><span class="section-number-3">1.1.</span> Exam Objectives</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org9789448" class="outline-4">
<h4 id="org9789448"><span class="section-number-4">1.1.1.</span> Utilizing Java Object­Oriented Approach</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Create <code>classes</code> and <code>records</code>, and define and use <code>instance</code> and <a href="20240113065406-static_variable.html#ID-90b4776a-f230-4e13-b1a1-248b48026677">Static Variables</a> and <a href="20240113065453-static_methods.html#ID-71f8ac46-9cca-4866-b701-8f5a7f9f7fc0">Static Methods</a>, <code>constructors</code>, and <code>instance</code> and <a href="20240114063138-static_initializers.html#ID-9b5e5215-73c3-412e-8a72-57dc575c1ee9">Static Initializers</a>.</li>

<li>Implement <code>overloading</code>, including <a href="20240107132638-variable_arguments.html#ID-9bb3ac0e-af2c-4243-9ae2-f2bfbee868c3">vararg</a> <code>methods</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6db0f1a" class="outline-3">
<h3 id="org6db0f1a"><span class="section-number-3">1.2.</span> 1. <a href="20240111055001-designing_methods.html#ID-4ee42137-51b3-40cf-91b0-209b5e8f8562">Designing Methods</a></h3>
</div>

<div id="outline-container-org3fb69e5" class="outline-3">
<h3 id="org3fb69e5"><span class="section-number-3">1.3.</span> 2. <a href="20240111055017-declaring_local_and_instance_variables.html#ID-c625f085-1416-483d-8344-47c2b4026643">Declaring Local and Instance Variables</a></h3>
</div>

<div id="outline-container-orgae19b7c" class="outline-3">
<h3 id="orgae19b7c"><span class="section-number-3">1.4.</span> 3. <a href="20240111055026-working_with_varargs.html#ID-68baee3c-a388-4f42-b24b-605e792c6c0a">Working with Varargs</a></h3>
</div>

<div id="outline-container-org96c39bf" class="outline-3">
<h3 id="org96c39bf"><span class="section-number-3">1.5.</span> 4. <a href="20240111055036-applying_access_modifiers.html#ID-67178034-6c34-44e5-ab5a-ea09f1aaa874">Applying Access Modifiers</a></h3>
</div>

<div id="outline-container-org90f5b92" class="outline-3">
<h3 id="org90f5b92"><span class="section-number-3">1.6.</span> 5. <a href="20240111055052-accessing_static_data.html#ID-abb7e1f4-8631-46e8-b272-9a86180ac34f">Accessing Static Data</a></h3>
</div>

<div id="outline-container-orga085a77" class="outline-3">
<h3 id="orga085a77"><span class="section-number-3">1.7.</span> 6. <a href="20240111055100-passing_data_among_methods.html#ID-5abc014e-1d13-4b57-80ca-ec233c6fff44">Passing Data among Methods</a></h3>
</div>

<div id="outline-container-org5420a11" class="outline-3">
<h3 id="org5420a11"><span class="section-number-3">1.8.</span> 7. <a href="20231226052415-method_overloading.html#ID-28b95eeb-be70-4b92-b599-aa95d6d9b5d7">Overloading Methods</a></h3>
</div>
</div>
</div>
</body>
</html>
